Revit 2027 API
FormatOptions Constructor
Overload List
Name | Description
FormatOptions() |  Creates a new FormatOptions object that represents default formatting.
FormatOptions(ForgeTypeId) |  Creates a new FormatOptions object that represents custom formatting.
FormatOptions(FormatOptions) |  Creates a copy of a FormatOptions object.
FormatOptions(ForgeTypeId, ForgeTypeId) |  Creates a new FormatOptions object that represents custom formatting.
Top
See Also
Reference
FormatOptions Class
Autodesk.Revit.DB Namespace